Extensions/нп_КонтрольПроведенияПоДО/src/InformationRegisters/нп_НастройкиКонтроляПроведенияПоДО/нп_НастройкиКонтроляПроведенияПоДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>нп_НастройкиКонтроляПроведенияПоДО</name>
  <dimensions>
    <name>ПолноеИмяОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <resources>
    <name>КонтролироватьПроведение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
</mdclass:InformationRegister>

Extensions/нп_КонтрольПроведенияПоДО/src/CommonModules/нп_КонтрольПроведенияПоСогласованиюДО/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает признак разрешения проведения по правилам согласования в 1С:Документооборот.
//
// Параметры:
//  СсылкаНаОбъект - ЛюбаяСсылка - ссылка на документ.
//
// Возвращаемое значение:
//  Булево - Истина, если проведение разрешено контролем ДО.
//
Функция РазрешеноПроведениеПоСогласованиюДО(СсылкаНаОбъект) Экспорт
	
	Если Не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ПолноеИмя = СсылкаНаОбъект.Метаданные().ПолноеИмя();
	Организация = ОрганизацияДокумента(СсылкаНаОбъект);
	РезультатПроверки = РезультатПроверкиПроведения(СсылкаНаОбъект, ПолноеИмя, Организация);
	Возврат РезультатПроверки.Разрешено;
	
КонецФункции

// Возвращает состояние согласования объекта в ДО по типовому регистру (без веб-вызова).
//
// Параметры:
//  СсылкаНаОбъект - ЛюбаяСсылка - ссылка на объект ERP.
//
// Возвращаемое значение:
//  Структура:
//    * ЕстьСвязьСДО - Булево
//    * Состояние - ПеречислениеСсылка.СостоянияСогласованияВДокументообороте, Неопределено
//    * Представление - Строка
//
Функция СостояниеСогласованияДО(СсылкаНаОбъект) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЕстьСвязьСДО", Ложь);
	Результат.Вставить("Состояние", Неопределено);
	Результат.Вставить("Представление", НСтр("ru = 'Нет связи с Документооборотом'"));
	
	Если Не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОбъектыИнтегрированныеС1СДокументооборотом.ИдентификаторОбъектаДО КАК ИдентификаторОбъектаДО,
		|	СостоянияСогласованияВДокументообороте.Состояние КАК Состояние
		|ИЗ
		|	РегистрСведений.ОбъектыИнтегрированныеС1СДокументооборотом КАК ОбъектыИнтегрированныеС1СДокументооборотом
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияСогласованияВДокументообороте КАК СостоянияСогласованияВДокументообороте
		|		ПО ОбъектыИнтегрированныеС1СДокументооборотом.ИдентификаторОбъектаДО = СостоянияСогласованияВДокументообороте.ИдентификаторОбъектаДО
		|ГДЕ
		|	ОбъектыИнтегрированныеС1СДокументооборотом.Объект = &СсылкаНаОбъект");
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат.ЕстьСвязьСДО = Истина;
	Результат.Состояние = Выборка.Состояние;
	
	Если Не ЗначениеЗаполнено(Выборка.Состояние) Тогда
		Результат.Представление = НСтр("ru = 'Связан с ДО, состояние не задано'");
	Иначе
		Результат.Представление = Строка(Выборка.Состояние);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает настройку контроля по типу документа и организации.
//
// Параметры:
//  ПолноеИмя - Строка - например, "Документ.ПеремещениеТоваров".
//  Организация - СправочникСсылка.Организации - организация документа.
//
// Возвращаемое значение:
//  Структура, Неопределено - Неопределено, если записи нет.
//
Функция НастройкаКонтроля(ПолноеИмя, Организация) Экспорт
	
	Возврат нп_КонтрольПроведенияПоСогласованиюДОПовтИсп.НастройкаКонтроля(ПолноеИмя, Организация);
	
КонецФункции

// Обработчик подписки ПередЗаписью документа: запрет проведения до согласования в ДО.
//
// Параметры:
//  Источник - ДокументОбъект - записываемый документ.
//  Отказ - Булево - признак отказа от записи.
//  РежимЗаписи - РежимЗаписиДокумента - режим записи.
//  РежимПроведения - РежимПроведенияДокумента - режим проведения.
//
Процедура ПроверитьПередЗаписьюДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеИмя = Источник.Метаданные().ПолноеИмя();
	Организация = ОрганизацияДокумента(Источник);
	
	СсылкаДляПроверки = Источник.Ссылка;
	Если Не ЗначениеЗаполнено(СсылкаДляПроверки) Тогда
		СсылкаДляПроверки = Источник.ПолучитьСсылкуНового();
	КонецЕсли;
	
	РезультатПроверки = РезультатПроверкиПроведения(СсылкаДляПроверки, ПолноеИмя, Организация);
	Если РезультатПроверки.Разрешено Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначения.СообщитьПользователю(РезультатПроверки.ТекстСообщения, Источник, , , Отказ);
	
КонецПроцедуры

// Выводит на форме документа состояние согласования в ДО для типов с включённым контролем.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа.
//
Процедура ПриСозданииФормыДокумента(Форма) Экспорт
	
	Если Форма = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ОбъектФормы = Форма.Объект;
	Исключение
		Возврат;
	КонецПопытки;
	
	Если ТипЗнч(ОбъектФормы) <> Тип("ДанныеФормыСтруктура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбъектФормы.Свойство("Ссылка") Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаНаОбъект = ОбъектФормы.Ссылка;
	Если Не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбщегоНазначения.ЭтоДокумент(СсылкаНаОбъект.Метаданные()) Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеИмя = СсылкаНаОбъект.Метаданные().ПолноеИмя();
	Организация = Неопределено;
	Если ОбъектФормы.Свойство("Организация") Тогда
		Организация = ОбъектФормы.Организация;
	Иначе
		Организация = ОрганизацияДокумента(СсылкаНаОбъект);
	КонецЕсли;
	
	Настройка = НастройкаКонтроля(ПолноеИмя, Организация);
	Если Настройка = Неопределено Или Не Настройка.КонтролироватьПроведение Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ИспользуетсяСогласованиеЧерезДО() Тогда
		Возврат;
	КонецЕсли;
	
	Состояние = СостояниеСогласованияДО(СсылкаНаОбъект);
	ДобавитьОтображениеСостоянияНаФорму(Форма, Состояние.Представление);
	
КонецПроцедуры

// Создаёт или обновляет настройку контроля для Документ.ПеремещениеТоваров по организации.
//
// Параметры:
//  Организация - СправочникСсылка.Организации - организация, для которой создаётся настройка.
//
Процедура УстановитьНастройкуПоУмолчаниюДляПеремещенияТоваров(Организация) Экспорт
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ВызватьИсключение НСтр("ru = 'Не указана организация для настройки контроля проведения по ДО.'");
	КонецЕсли;
	
	ПолноеИмя = "Документ.ПеремещениеТоваров";
	
	МенеджерЗаписи = РегистрыСведений.нп_НастройкиКонтроляПроведенияПоДО.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ПолноеИмяОбъектаМетаданных = ПолноеИмя;
	МенеджерЗаписи.Организация = Организация;
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.ПолноеИмяОбъектаМетаданных = ПолноеИмя;
	МенеджерЗаписи.Организация = Организация;
	МенеджерЗаписи.КонтролироватьПроведение = Истина;
	МенеджерЗаписи.Записать();
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИспользуетсяСогласованиеЧерезДО()
	
	Если Не Константы.ИспользоватьСогласованиеЧерез1СДокументооборот.Получить() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИспользуетсяИнтеграция =
		Константы.ИспользоватьИнтеграциюС1СДокументооборот.Получить()
		Или Константы.ИспользоватьИнтеграциюС1СДокументооборот3.Получить();
	
	Возврат ИспользуетсяИнтеграция;
	
КонецФункции

Функция ЕстьПравоОбходаКонтроля()
	
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат РольДоступна(Метаданные.Роли.нп_ОбходКонтроляСогласованияДО);
	
КонецФункции

Функция ОрганизацияДокумента(Документ)
	
	Если Документ = Неопределено Тогда
		Возврат Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	МетаданныеДокумента = Документ.Метаданные();
	Если Не ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", МетаданныеДокумента) Тогда
		Возврат Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Документ)) Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "Организация");
	КонецЕсли;
	
	Возврат Документ.Организация;
	
КонецФункции

Функция РезультатПроверкиПроведения(СсылкаНаОбъект, ПолноеИмя, Организация)
	
	Результат = Новый Структура("Разрешено, ТекстСообщения", Истина, "");
	
	Если Не ИспользуетсяСогласованиеЧерезДО() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Настройка = НастройкаКонтроля(ПолноеИмя, Организация);
	Если Настройка = Неопределено Или Не Настройка.КонтролироватьПроведение Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ЕстьПравоОбходаКонтроля() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Состояние = СостояниеСогласованияДО(СсылкаНаОбъект);
	Согласован = (Состояние.Состояние = Перечисления.СостоянияСогласованияВДокументообороте.Согласован);
	
	Если Согласован Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат.Разрешено = Ложь;
	Результат.ТекстСообщения = СтрШаблон(
		НСтр("ru = 'Проведение запрещено: документ не согласован в 1С:Документооборот (текущее состояние: %1).'"),
		Состояние.Представление);
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьОтображениеСостоянияНаФорму(Форма, ПредставлениеСостояния)
	
	ИмяРеквизита = "нп_СостояниеСогласованияДО";
	ИмяЭлемента = "нп_СостояниеСогласованияДО";
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	ЕстьРеквизит = Ложь;
	Для Каждого РеквизитФормы Из Форма.ПолучитьРеквизиты() Цикл
		Если РеквизитФормы.Имя = ИмяРеквизита Тогда
			ЕстьРеквизит = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьРеквизит Тогда
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяРеквизита, Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(200))));
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	КонецЕсли;
	
	Форма[ИмяРеквизита] = ПредставлениеСостояния;
	
	Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
		
		Родитель = Неопределено;
		Если Форма.Элементы.Найти("ГруппаШапка") <> Неопределено Тогда
			Родитель = Форма.Элементы.ГруппаШапка;
		ИначеЕсли Форма.Элементы.Найти("Шапка") <> Неопределено Тогда
			Родитель = Форма.Элементы.Шапка;
		КонецЕсли;
		
		Если Родитель = Неопределено Тогда
			Поле = Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"));
		Иначе
			Поле = Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), Родитель);
		КонецЕсли;
		
		Поле.Вид = ВидПоляФормы.ПолеНадписи;
		Поле.ПутьКДанным = ИмяРеквизита;
		Поле.Заголовок = НСтр("ru = 'Согласование ДО'");
		Поле.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
